Repository: mmmartn792-svg/flutter-project
Catalog: lib/l10n/intl_*.arb
Languages: ar

# titleLogin
source: Sign In
ar: تسجيل الدخول

# title2login
source: Enter the phone number associated with your account
ar: قم بإدخال رقم الهاتف الخاص بحسابك

source: Phone Number
ar: رقم الجوال

# validate1
source: Please enter phone number
ar: الرجاء إدخال رقم الجوال

# forgetPassword
source: Forgot Password?
ar: نسيت كلمة المرور؟

source: Password
ar: كلمة المرور

# validate2
source: Please enter password
ar: الرجاء إدخال كلمة المرور

# newAccountget
source: Or get a
ar: 'أو قم بالحصول على

source: new account
ar: حساب جديد

# createAccount
source: Create New Account
ar: إنشاء حساب جديد

# name1
source: First Name
ar: الاسم الأول

# name2
source: Last Name
ar: الاسم الثاني

# validateFirstName
source: Please Enter First Name
ar: الرجاء إدخال الاسم الأول

# validateSecondName
source: Please Enter Last Name
ar: الرجاء إدخال الاسم الثاني

source: phoneNumber
ar: رقم الجوال

# validatephone
source: Please Enter PhoneNumber
ar: رقم الجوال مطلوب

source: confirmpassword
ar: تأكيد كلمة المرور

# Validateconfirmpass
source: Please confirmpassword
ar: تأكيد كلمة المرور مطلوبة

# date
source: Enter date Birthday
ar: اختر تاريخ الميلاد

# validateDAte
source: Please Enter dateBirthday
ar: الرجاء اختيار تاريخ الميلاد

# renterOrOwner
source: Please Enter role
ar: هل انت مالك ام مستأجر؟؟

source: renter
ar: مستأجر

source: owner
ar: مالك

# validateRole
source: Please Enter your Role
ar: الرجاء اختيار دورك

# enterYourImage
source: Enter Personal photo
ar: تحميل الصورة الشخصية

# imagId
source: Enter Personal photo ID
ar: تحميل صورة الهوية الشخصية

source: Error
ar: تنبيه

# dec
source: Please upload the required images
ar: الرجاء تحميل الصور المطلوبة قبل إنشاء الحساب

# createAcount
source: Create account
ar: إنشاء الحساب

# getApartment
source: The Apartments were Successfully loaded
ar: تم جلب الشقق بنجاح

source: HomePage
ar: الصفحة الرئيسية

# awesaTitle
source: Log out
ar: تسجيل الخروج

# awsdec
source: Are you sure you want to log out?
ar: هل أنت متأكد من تسجيل الخروج؟

# noApartment
source: There apartments to display
ar: لا توجد شقق لعرضها

# choselan
source: please select a language
ar: الرجاء اختيار لغة البرنامج

# darkAndLang
source: language and darke Mode
ar: اللغة والوضع الليلي

# masenger
source: please create Owner`s account
ar: الرجاء انشاء حساب مالك

# btnCancelText
source: Cansel
ar: لا

# btnOkText
source: Ok
ar: نعم

# damas
source: Damascus City
ar: دمشق المدينة

# qanawat
source: al-Qanawt
ar: القنوات

# medan
source: al-meidan
ar: الميدان

source: Bab Tuma
ar: باب توما

# sarojah
source: Saroujah
ar: ساروجا

source: Douma
ar: دوما

source: Al-Tall
ar: التل

source: Al-Qutayfah
ar: القطيفة

source: Aleppo City
ar: حلب المدينة

source: Manbij
ar: منبج

source: Azaz
ar: عزاز

source: Idlib City
ar: ادلب المدينة

source: Maarrat al-Nuuman
ar: معرة النعمان

source: Homs City
ar: حمص المدينة

source: Al-Rastan
ar: الرستن

source: Hama City
ar: حماه

source: Masyaf
ar: مصياف

source: Latakia City
ar: اللاذقية المدينة

source: Jableh
ar: جبلة

source: Tartus City
ar: طرطوس المدينة

source: Baniyas
ar: بنياس

source: Deir ez-Zor City
ar: دير الزور المدينة

source: Al-Mayadin
ar: الميادين

source: Raqqa City
ar: الرقة المدينة

source: Al-Thawrah
ar: الثوره

# laprice
source: Price ($)
ar: السعر ($)

# validatorpric
source: please Enter price
ar: الرجاء ادخال السعر

# Addtitl
source: Add Apartment
ar: إضافة شقة

source: Add Photos
ar: اضافة صور

# ADDphoto
source: Photo Picker Placeholder
ar: انقر لاضافة الصور

source: City
ar: المدينة

# validatorcity
source: please enter city
ar: الرجاء تحديد المدينة

# validatorarea
source: please Enter area
ar: الرجاء إدخال المساحة

source: WiFi
ar: انترنت

source: Air Conditioning
ar: تكييف

source: Swimming Pool
ar: حمام سباحة

source: Gym
ar: نادي

source: Parking
ar: كراج

source: Pet Friendly
ar: مكان خاص للحيوانات الاليفة

source: Breakfast Included
ar: وجبة فطور

source: Airport Shuttle
ar: نقل من المطار

source: Spa
ar: منتجع صحي

source: Restaurant
ar: مطعم

source: Bar
ar: حانة

source: Laundry Service
ar: خدمة غسيل الملابس

source: Room Service
ar: خدمة الغرف

# HourFrontDesk
source: 24-Hour Front Desk
ar: خدمة الاستقبال 24 ساعة

source: Business Center
ar: مركز اعمال

source: Conference Rooms
ar: غرفة للاجتماعات

# tit
source: please Enter title
ar: الرجاء ادخال العنوان

# dest
source: please Enter description
ar: الرجاء ادخال الوصف

# typeapar
source: type of rental
ar: نوع الايجار

source: daily
ar: يومي

source: monthly
ar: شهري

source: yearly
ar: سنوي

# hiiiii
source: Target segment
ar: الشريجة المستهدفة

source: family
ar: عائلي

source: single
ar: فردي

source: students
ar: طلاب

source: employees
ar: موظفين

# floor
source: select the floor
ar: حدد رقم الطابق

source: land
ar: ارضي

source: first
ar: الطابق الاول

source: second
ar: الطابق الثاني

source: third
ar: الطابق الثالث

source: fourth
ar: الطابق الرابع

source: fifth
ar: الطابق الخامس

# nroom
source: Enter number rooms
ar: ادخل عدد الغرف

# room1
source: one room
ar: غرفة واحدة

# room2
source: two room
ar: غرفتين

# room3
source: three room
ar: ثلاث غرف

# room4
source: four room
ar: اربع غرف

# room5
source: fife room
ar: خمس غرف

source: Eroor
ar: خطأ

# des
source: please Enter allAmenities
ar: الرجاء اختيار المرافق المتوفرة

# des2
source: please Enter images Apartment
ar: الرجاء إضافة صورة للشقة

# amanty
source: Select available services
ar: الرجاء تحديد المرافق المتوفرة

source: Booking
ar: معلومات الحجز

# date1
source: ŸèEnter Date Start Booking Date
ar: ادخل تاريخ بدء الحجز

# date2
source: Enter Date End Booking date
ar: ادخل تاريخ انتهاء الحجز

# book
source: Booking
ar: حجز

# dark
source: Dark Mode
ar: الوضع الليلي

# rent
source: please create renter Account
ar: الرجاء انشاء حساب مستأجر

# About
source: About this place
ar: المزيد عن المكان

# About1
source: Beautiful modern apartment in the heart of
ar: شقة عصرية جميلة في قلب

# About2
source: Features stunning city views, high-end finishes, and easy access to top restaurants and attractions.
ar: تتميز ب اطلالات جميلة و اكساء فاخر وسهولة الوصول الى افضل المطاعم

# public
source: Genral Information
ar: معلومات عامة

# numberapa
source: number apartment : #
ar: رقم الشقة: #

# whatAmen
source: What does this place offer
ar: ماذا يقدم هذا المكان

# rever
source: Reviews
ar: المراجعات

# All
source: View All
ar: عرض الكل

# bookNow
source: Booking Now
ar: احجز الآن

# name
source: Michael Chen
ar: محمد محمد

# text
source: Amazing apartment! Clean, modern, and perfectly located. Sarah was a wonderful host and very responsive. Highly recommend!
ar: شقة رائعة ونظيفة، سارة كانت مضيفة رائعة ومتجاوبة. أوصي بشدة

# date11
source: December 2024
ar: كانون الاول 2024

source: Damascus
ar: دمشق

source: Rif Dimashq
ar: ريف دمشق

source: Aleppo
ar: حلب

source: Idlib
ar: ادلب

source: Homs
ar: حمص

source: Hama
ar: حماه

source: Latakia
ar: اللاذقية

source: Tartus
ar: طرطوس

source: Deir ez-Zor
ar: دير الزور

# newstate
source: New Status
ar: الحالة الجديدة

source: Raqqa
ar: الرقة

source: Al-Hasakah
ar: الحسكة

# details
source: Notification details
ar: تفاصيل الإشعار

source: Daraa
ar: درعا

source: As-Suwayda
ar: السويداء

# end
source: ended
ar: منتهي

source: Quneitra
ar: القنيطرة

# Bookings
source: My Bookings
ar: حجوزاتي

# invalidDateRange
source: please Enter DAte correctly
ar: ادخل التاريخ بشكل صحيح!

# refresh
source: Try again
ar: إعادة المحاولة

source: My Bookings
ar: حجوزاتي

# noBookings
source: No reservations currently available
ar: لا توجد حجوزات حالياً

# errorinBookings
source: An error occurred during loading
ar: حدث خطأ في تحميل الحجوزات

# again
source: Try again
ar: إعادة المحاولة

# loading
source: loading Bookings
ar: جاري تحميل الحجوزات...

# confirmcancel
source: Confirm Cancellation
ar: تأكيد الإلغاء

# confirmtt
source: Are you sure about cancelling the reservation?
ar: هل أنت متأكد من أنك تريد إلغاء هذا الحجز؟

source: backed
ar: تراجع

# canceleBookings
source: Cancel Bookings
ar: إلغاء الحجز

# modifyDate
source: Change Booking date
ar: تعديل تاريخ الحجز

source: My Apartments
ar: شققي

# noApartments
source: You have no Apartments
ar: لا توجد شقق لديك حالياً

# eror
source: An error occurred in loading the apartments
ar: حدث خطأ في تحميل الشقق

# loadings
source: Apartments are being loaded
ar: جاري تحميل الشقق...

source: Aproved
ar: مؤكدة

# inWiting
source: Witing
ar: في الانتظار

source: Disapproved
ar: مرفوضة

# bookingsForApartment
source: Bookings for this apartment
ar: الحجوزات على هذه الشقة

# ok
source: Agree
ar: موافقة

source: Disagree
ar: رفض

# val
source: The end date must be before the start date
ar: تاريخ النهاية يجب أن يكون بعد تاريخ البداية

# val2
source: the start date must be different the end date
ar: تاريخ النهاية يجب أن يكون مختلفاً عن تاريخ البداية

# bookingsw
source: Booking Waiting
ar: طلبك قيد المراجعة

# messagNot
source: Your reservation has been successfully confirmed. You'll receive a confirmation email shortly with all the details.
ar: تم تأكيد طلب الحجز بنجاح سيتم ارسال اشعار عند قبول طلب الحجز

# detailbooking
source: Booking Details
ar: تفاصيل الحجز

source: Property
ar: الملكية

source: Dates
ar: التاريخ

# total
source: Total Paid
ar: المبلغ الكلي

# View
source: View Bookings
ar: حجوزاتي

# backHome
source: Back to Home
ar: العودة الى الصفحة الرئيسية

# filterapr
source: Apartment filtering
ar: فلترة الشقق

source: Province
ar: المحافظة

source: area
ar: المساحة

# searche
source: Search
ar: بحث

# ennter
source: Specify the required specifications
ar: حدد المواصفات المطلوبة

# ar
source: en
ar: ar

source: Now
ar: الآن

source: Minute
ar: دقيقة

source: Hour
ar: ساعة

source: Day
ar: يوم

source: No Notification
ar: لا توجد إشعارات هنا

# notification
source: Notifications
ar: الإشعارات

# Alll
source: All
ar: الكل

source: Not Read
ar: غير مقروء

# err
source: An error occurred while fetching notifications .
ar: حدث خطأ أثناء جلب الإشعارات

source: message
ar: الرسالة

# RAting
source: Rating Apartment
ar: تقييم الشقة

# Stars
source: How would you rate this apartment?
ar: كم تقييم هذه الشقة؟

# write
source: Write your comment:
ar: : اكتب تعليقك

# opinion
source: ....Write your opinion for apartment
ar: ...اكتب رأيك عن الشقة

# comment
source: please enter comment
ar: الرجاء ترك تعليق

# SendComent
source: Send Comment
ar: إرسال التقييم

# whatPeopleSay
source: what say people
ar: اخر المراجعات

# basedOn
source: based On Experiences
ar: التقييم بناء على تجارب المستخدمين

# reviews
source: Number reviews
ar: عدد المراجعات

source: Favorites
ar: المفضلة
